<a href="https://colab.research.google.com/github/Kishan-09/Video-Game-Sales/blob/main/PG24_3C_Exercise.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

![Yantrajaal Banner](https://github.com/Praxis-QR/RDWH/raw/main/images/YantraJaalBanner.png)<br>


<hr>

[Prithwis Mukerjee](http://www.linkedin.com/in/prithwis)<br>

#Postgres Exercises
https://pgexercises.com/ <br>
https://pgexercises.com/gettingstarted.html

In [1]:
from datetime import datetime
import pytz
print('ॐ श्री सरस्वत्यै नमः',datetime.now(pytz.timezone('Asia/Calcutta')))
!python --version
!lsb_release -a

ॐ श्री सरस्वत्यै नमः 2025-08-18 00:08:44.920231+05:30
Python 3.11.13
No LSB modules are available.
Distributor ID:	Ubuntu
Description:	Ubuntu 22.04.4 LTS
Release:	22.04
Codename:	jammy

#Install & Configure Postgres

In [2]:
# Install postgresql server

!apt update > /dev/null
!apt install postgresql > /dev/null
#!sudo -u postgres psql -V
!psql -V
!service postgresql start

WARNING: apt does not have a stable CLI interface. Use with caution in scripts.

W: Skipping acquire of configured file 'main/source/Sources' as repository 'https://r2u.stat.illinois.edu/ubuntu jammy InRelease' does not seem to provide it (sources.list entry misspelt?)

WARNING: apt does not have a stable CLI interface. Use with caution in scripts.

psql (PostgreSQL) 14.18 (Ubuntu 14.18-0ubuntu0.22.04.1)
 * Starting PostgreSQL 14 database server
   ...done.

In [3]:
#!pip install psycopg2
import psycopg2
import pandas as pd

#Create Schema, Tables and Insert Data

In [4]:
# Change the database superuser 'postgres' to a non-default value 'pass'
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'pass';"

ALTER ROLE

In [5]:
# Download and execute SQL file to create tables, load data
#
#!wget https://pgexercises.com/dbfiles/clubdata.sql
!wget -q https://raw.githubusercontent.com/Praxis-QR/RDWH/main/data/clubdata.sql
#Run the batch file to create tables, load data
!psql -h localhost -U postgres -f clubdata.sql -d postgres -x -q

Password for user postgres:

In [6]:
# Create file to store the password. Else will be prompted each time
#!echo "localhost:5432:praxisdb:postgres:pass" > ~/.pgpass
!echo "localhost:5432:exercises:postgres:pass" > ~/.pgpass
!chmod 0600 ~/.pgpass
!cat ~/.pgpass

localhost:5432:exercises:postgres:pass

In [7]:
#Note new database called exercises
!psql -h localhost -p 5432 -Upostgres -c "\l"

Password for user postgres:
                                  List of databases
   Name    |  Owner   | Encoding |   Collate   |    Ctype    |   Access privileges
-----------+----------+----------+-------------+-------------+-----------------------
 exercises | postgres | UTF8     | en_US.UTF-8 | en_US.UTF-8 |
 postgres  | postgres | UTF8     | en_US.UTF-8 | en_US.UTF-8 |
 template0 | postgres | UTF8     | en_US.UTF-8 | en_US.UTF-8 | =c/postgres          +
           |          |          |             |             | postgres=CTc/postgres
 template1 | postgres | UTF8     | en_US.UTF-8 | en_US.UTF-8 | =c/postgres          +
           |          |          |             |             | postgres=CTc/postgres
(4 rows)

In [8]:
#Note three tables under schema cd
!psql -h localhost -p 5432 -Upostgres -d exercises -c "\dt+ cd.*"

                                      List of relations
 Schema |    Name    | Type  |  Owner   | Persistence | Access method |  Size  | Description
--------+------------+-------+----------+-------------+---------------+--------+-------------
 cd     | bookings   | table | postgres | permanent   | heap          | 264 kB |
 cd     | facilities | table | postgres | permanent   | heap          | 16 kB  |
 cd     | members    | table | postgres | permanent   | heap          | 16 kB  |
(3 rows)

In [9]:
#Note column / datatypes of all tables under schema cd
!psql -h localhost -p 5432 -Upostgres -d exercises -c "\d cd.*"

                           Table "cd.bookings"
  Column   |            Type             | Collation | Nullable | Default
-----------+-----------------------------+-----------+----------+---------
 bookid    | integer                     |           | not null |
 facid     | integer                     |           | not null |
 memid     | integer                     |           | not null |
 starttime | timestamp without time zone |           | not null |
 slots     | integer                     |           | not null |
Indexes:
    "bookings_pk" PRIMARY KEY, btree (bookid)
    "bookings.facid_memid" btree (facid, memid)
    "bookings.facid_starttime" btree (facid, starttime)
    "bookings.memid_facid" btree (memid, facid)
    "bookings.memid_starttime" btree (memid, starttime)
    "bookings.starttime" btree (starttime)
Foreign-key constraints:
    "fk_bookings_facid" FOREIGN KEY (facid) REFERENCES cd.facilities(facid)
    "fk_bookings_memid" FOREIGN KEY (memid) REFERENCES cd.members(memid)

   Index "cd.bookings.facid_memid"
 Column |  Type   | Key? | Definition
--------+---------+------+------------
 facid  | integer | yes  | facid
 memid  | integer | yes  | memid
btree, for table "cd.bookings"

             Index "cd.bookings.facid_starttime"
  Column   |            Type             | Key? | Definition
-----------+-----------------------------+------+------------
 facid     | integer                     | yes  | facid
 starttime | timestamp without time zone | yes  | starttime
btree, for table "cd.bookings"

   Index "cd.bookings.memid_facid"
 Column |  Type   | Key? | Definition
--------+---------+------+------------
 memid  | integer | yes  | memid
 facid  | integer | yes  | facid
btree, for table "cd.bookings"

             Index "cd.bookings.memid_starttime"
  Column   |            Type             | Key? | Definition
-----------+-----------------------------+------+------------
 memid     | integer                     | yes  | memid
 starttime | timestamp without time zone | yes  | starttime
btree, for table "cd.bookings"

                Index "cd.bookings.starttime"
  Column   |            Type             | Key? | Definition
-----------+-----------------------------+------+------------
 starttime | timestamp without time zone | yes  | starttime
btree, for table "cd.bookings"

        Index "cd.bookings_pk"
 Column |  Type   | Key? | Definition
--------+---------+------+------------
 bookid | integer | yes  | bookid
primary key, btree, for table "cd.bookings"

                            Table "cd.facilities"
       Column       |          Type          | Collation | Nullable | Default
--------------------+------------------------+-----------+----------+---------
 facid              | integer                |           | not null |
 name               | character varying(100) |           | not null |
 membercost         | numeric                |           | not null |
 guestcost          | numeric                |           | not null |
 initialoutlay      | numeric                |           | not null |
 monthlymaintenance | numeric                |           | not null |
Indexes:
    "facilities_pk" PRIMARY KEY, btree (facid)
Referenced by:
    TABLE "cd.bookings" CONSTRAINT "fk_bookings_facid" FOREIGN KEY (facid) REFERENCES cd.facilities(facid)

       Index "cd.facilities_pk"
 Column |  Type   | Key? | Definition
--------+---------+------+------------
 facid  | integer | yes  | facid
primary key, btree, for table "cd.facilities"

                              Table "cd.members"
    Column     |            Type             | Collation | Nullable | Default
---------------+-----------------------------+-----------+----------+---------
 memid         | integer                     |           | not null |
 surname       | character varying(200)      |           | not null |
 firstname     | character varying(200)      |           | not null |
 address       | character varying(300)      |           | not null |
 zipcode       | integer                     |           | not null |
 telephone     | character varying(20)       |           | not null |
 recommendedby | integer                     |           |          |
 joindate      | timestamp without time zone |           | not null |
Indexes:
    "members_pk" PRIMARY KEY, btree (memid)
    "members.joindate" btree (joindate)
    "members.recommendedby" btree (recommendedby)
Foreign-key constraints:
    "fk_members_recommendedby" FOREIGN KEY (recommendedby) REFERENCES cd.members(memid) ON DELETE SET NULL
Referenced by:
    TABLE "cd.bookings" CONSTRAINT "fk_bookings_memid" FOREIGN KEY (memid) REFERENCES cd.members(memid)
    TABLE "cd.members" CONSTRAINT "fk_members_recommendedby" FOREIGN KEY (recommendedby) REFERENCES cd.members(memid) ON DELETE SET NULL

                Index "cd.members.joindate"
  Column  |            Type             | Key? | Definition
----------+-----------------------------+------+------------
 joindate | timestamp without time zone | yes  | joindate
btree, for table "cd.members"

        Index "cd.members.recommendedby"
    Column     |  Type   | Key? |  Definition
---------------+---------+------+---------------
 recommendedby | integer | yes  | recommendedby
btree, for table "cd.members"

        Index "cd.members_pk"
 Column |  Type   | Key? | Definition
--------+---------+------+------------
 memid  | integer | yes  | memid
primary key, btree, for table "cd.members"

In [10]:
#Note column / datatypes of all tables under schema cd
!psql -h localhost -p 5432 -Upostgres -d exercises -c "\d cd.members"

                              Table "cd.members"
    Column     |            Type             | Collation | Nullable | Default
---------------+-----------------------------+-----------+----------+---------
 memid         | integer                     |           | not null |
 surname       | character varying(200)      |           | not null |
 firstname     | character varying(200)      |           | not null |
 address       | character varying(300)      |           | not null |
 zipcode       | integer                     |           | not null |
 telephone     | character varying(20)       |           | not null |
 recommendedby | integer                     |           |          |
 joindate      | timestamp without time zone |           | not null |
Indexes:
    "members_pk" PRIMARY KEY, btree (memid)
    "members.joindate" btree (joindate)
    "members.recommendedby" btree (recommendedby)
Foreign-key constraints:
    "fk_members_recommendedby" FOREIGN KEY (recommendedby) REFERENCES cd.members(memid) ON DELETE SET NULL
Referenced by:
    TABLE "cd.bookings" CONSTRAINT "fk_bookings_memid" FOREIGN KEY (memid) REFERENCES cd.members(memid)
    TABLE "cd.members" CONSTRAINT "fk_members_recommendedby" FOREIGN KEY (recommendedby) REFERENCES cd.members(memid) ON DELETE SET NULL

## Python Access
https://www.tutorialspoint.com/python_data_access/python_postgresql_database_connection.htm

In [11]:
# Local Colab server

conn = psycopg2.connect(database="exercises", user='postgres', password='pass', host='127.0.0.1', port= '5432')
#Creating a cursor object using the cursor() method
cursor = conn.cursor()
#Executing an MYSQL function using the execute() method
cursor.execute("select version()")
# Fetch a single row using fetchone() method.
data = cursor.fetchone()
print("Connection established to: ",data)
#Closing the connection
conn.close()

Connection established to:  ('PostgreSQL 14.18 (Ubuntu 14.18-0ubuntu0.22.04.1) on x86_64-pc-linux-gnu, compiled by gcc (Ubuntu 11.4.0-1ubuntu1~22.04) 11.4.0, 64-bit',)

In [12]:
# function to execute SQL select statements with Postgres
#
def runSelect(s):
    #Set up connection

    conn = psycopg2.connect(database="exercises", user='postgres', password='pass', host='127.0.0.1', port= '5432')
    #Setting auto commit true
    conn.autocommit = True
    #Creating a cursor object using the cursor() method
    cursor = conn.cursor()
    #Retrieving data
    cursor.execute(s)
    #Fetching all rows from the table
    result = cursor.fetchall();
    #print(len(result))
    if (len(result)) > 0:                                       # result contains at least one row
        colnames = [desc[0] for desc in cursor.description]     # get column names
        #print(colnames)
        resultdf = pd.DataFrame(result)                         # convert list to dataframe
        resultdf.columns = colnames                             # add column names
        #return resultdf
        return resultdf.style.hide()                            # hide the index
    else:
        print('no records found')
        return
# function to execute SQL non-select statements with Postgres
#
def runCmd(s):
    #Create Connection
    conn = psycopg2.connect(database="exercises", user='postgres', password='pass', host='127.0.0.1', port= '5432')
    #Creating a cursor object using the cursor() method
    cursor = conn.cursor()
    try:
        cursor.execute(s)
        print('Command executed')
        conn.commit()
    except:
        print('Command failed')
    #Closing the connection
    conn.close()

In [13]:
def pyClient(s):
    if s.split(' ', 1)[0].lower() == 'select':      # If first word = select
        df = runSelect(s)                           # then use runSelect()
        return df                                   # return the pandas dataframe obtained from runSelect()
    else:                                           # else
        runCmd(s)                                   # use runCmd()

##Check Data

In [14]:
#runSelect("select * from cd.members limit 3")
pyClient("select * from cd.members limit 3")

In [15]:
#runSelect("select * from cd.facilities limit 3")
pyClient("select * from cd.facilities limit 3")

In [16]:
#runSelect("select * from cd.bookings limit 3")
pyClient("select * from cd.bookings limit 3")

In [17]:
# Testing pyClient for non-Select SQL

#pyClient('create table test(col1 char(10))')
#pyClient("insert into test (col1) values('bbb')")
#pyClient('select * from test')

##Modifying Data

In [18]:
sql = "\
insert into cd.facilities \
    (facid, name, membercost, guestcost, initialoutlay, monthlymaintenance) \
    values (9, 'Spa', 20, 30, 100000, 800); \
"
#print(sql)
pyClient(sql)

Command executed

In [19]:
sql = "\
insert into cd.facilities \
    (facid, name, membercost, guestcost, initialoutlay, monthlymaintenance) \
    values \
        (9, 'Spa', 20, 30, 100000, 800), \
        (10, 'Squash Court 2', 3.5, 17.5, 5000, 80);\
"

In [20]:
sql = "\
insert into cd.facilities \
    (facid, name, membercost, guestcost, initialoutlay, monthlymaintenance) \
    values \
         (99, 'Spa', 20, 30, 100000, 800), \
         (10, 'Squash Court 2', 3.5, 17.5, 5000, 80);\
"

pyClient(sql)

Command executed

#ChronoTYM <br>
In Indic phraseology, tantra is knowledge, a yantra is a device to explore this knowledge and a mantra is the code that unlocks both the tantra and its yantra. Chrono/TYM a sci-fi trilogy that recreates this framework where the first novel Chronotantra defines the contours of a tech driven, futuristic society, the second, Chronoyantra, describes a device used to explore the genesis of this society, while the third, Chronomantra finally reveals the code, the key, that unlocks this puzzle.  [More information](http://bit.ly/chronobooks) <br>
![alt text](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjdu_ajYwBRzk5iFYlcs59ZoRMMg6rhNm4JERKspvFJoveJsnfwRlzMICiC37UOja_Bd4sbfLA1pyyBbe0mj3tUfDBXoqCzNUDw3Wux7acoJBaLkWjAvJXfa7drRY2GQRAlFxEY9O7a7raY4RKy7cA3Uxgf5QsaZQ99C9GfXxFSex_rke8ROhAn41t8zOqK/s1640/tymBanner01_3.png)

In [21]:
from datetime import datetime
import pytz
print('Last tested  ',datetime.now(pytz.timezone('Asia/Kolkata')))

Last tested   2025-08-18 00:09:35.418509+05:30

**1. Basic**

1.1. Retrieve everything from a table

In [22]:
pyClient("select facid, name, membercost, guestcost, initialoutlay, monthlymaintenance from cd.facilities")

1.2 Retrieve specific columns from a table

In [23]:
pyClient("select name, membercost from cd.facilities")

1.3  Control which rows are retrieved (Where)

In [24]:
pyClient("select facid, name, membercost, guestcost, initialoutlay, monthlymaintenance from cd.facilities where membercost>0 ")

1.4 Control which rows are retrieved - part 2

In [25]:
pyClient("select facid,name, membercost, monthlymaintenance from cd.facilities where membercost=35")

1.5 Basic string searches

In [26]:
pyClient("select * from cd.facilities where name like 'Tennis%' or name like 'Table%'")

1.6 Matching against multiple possible values

In [27]:
pyClient("select * from cd.facilities where facid in (1,5)")

1.7 Classify results into buckets

In [28]:
pyClient("select name, case when (monthlymaintenance > 100) then 'expensive' else 'cheap' end as cost from cd.facilities")

1.8 Working with dates

In [29]:
pyClient("select memid, surname, firstname, joindate from cd.members where joindate>'2012-09-01'")

1.9 Removing duplicates, and ordering results

In [32]:
pyClient("select distinct surname from cd.members order by surname limit 10")

1.10 Combining results from multiple queries

In [35]:
pyClient("select surname from cd.members union select name from cd.facilities")

1.11 Simple aggregation

In [36]:
pyClient("select joindate from cd.members order by joindate desc limit 1")

1.12 More aggregation

In [37]:
pyClient("select firstname, surname, joindate from cd.members where joindate=(select max(joindate) from cd.members)")

**2 Joins and Subqueries**

2.1